# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 with P3-only PGHeadEnhance and clean bottom-up skip.
# This keeps PGM-enhanced P3 for Detect(P3), but feeds the bottom-up PAN path
# from raw P3 C2f features instead of PGM-enhanced P3.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8s-PGM-P3-clean.yaml' will call this file with scale 's'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone - standard YOLOv8
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

# Head - PAN-FPN with P3-only PGHeadEnhance
head:
  # Top-down path: P5 -> P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P4
  - [-1, 3, C2f, [512]] # 12-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3
  - [-1, 3, C2f, [256]] # 15-P3/8 raw fused feature

  # PGM only feeds Detect(P3).
  - [-1, 1, PGHeadEnhance, []] # 16-PGM(P3)

  # Bottom-up path uses raw P3 from layer 15, not PGM(P3) from layer 16.
  - [15, 1, Conv, [256, 3, 2]] # 17 clean skip from raw P3
  - [[-1, 12], 1, Concat, [1]] # 18 cat head P4
  - [-1, 3, C2f, [512]] # 19-P4/16

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 9], 1, Concat, [1]] # 21 cat head P5
  - [-1, 3, C2f, [1024]] # 22-P5/32

  # Detect on PGM-enhanced P3, clean P4, and clean P5.
  - [[16, 19, 22], 1, Detect, [nc]] # 23-Detect(P3, P4, P5)
