# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 object detection model with FFCA-style FEM lateral enhancement.
# FEM is adapted for YOLOv8 as a residual multi-branch context module and is
# applied only to the P3/P4 lateral features consumed by the neck. The deeper
# backbone path continues from raw C2f outputs, matching FFCA-YOLO's intent of
# enhancing fusion inputs without disturbing the main downsampling chain.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-FEM.yaml' will call yolov8-FEM.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8 raw
  - [-1, 1, FEM, [256, 8, 0.1]] # 5-P3/8 enhanced lateral
  - [-2, 1, Conv, [512, 3, 2]] # 6-P4/16 from raw P3
  - [-1, 6, C2f, [512, True]] # 7-P4/16 raw
  - [-1, 1, FEM, [512, 8, 0.1]] # 8-P4/16 enhanced lateral
  - [-2, 1, Conv, [1024, 3, 2]] # 9-P5/32 from raw P4
  - [-1, 3, C2f, [1024, True]] # 10
  - [-1, 1, SPPF, [1024, 5]] # 11-P5/32

# YOLOv8.0 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat FEM-enhanced P4
  - [-1, 3, C2f, [512]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat FEM-enhanced P3
  - [-1, 3, C2f, [256]] # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat backbone P5
  - [-1, 3, C2f, [1024]] # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)
