# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8s-MCGAM-sigma03: P3-only top-k multi-center Gaussian attention
# with narrower spatial Gaussian maps.
#
# Compared with yolov8s-MCGAM.yaml, this config changes only spatial_sigma:
#   spatial_sigma 0.5 -> 0.3
# The goal is to keep MCGAM's recovered recall while reducing overly broad
# spatial enhancement that may hurt localization and PR ranking.

nc: 80 # number of classes
depth_multiple: 0.33
width_multiple: 0.50

# YOLOv8s backbone with MCGAM only after the P3 C2f block.
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, MCGAM, [256, [1, 3, 5, 7], True, 0.5, 0.3, 0.000001, 0.0, 4, 3, "union"]] # 5-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 6, C2f, [512, True]] # 7-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 3, C2f, [1024, True]] # 9
  - [-1, 1, SPPF, [1024, 5]] # 10

# Standard YOLOv8s PAN-FPN head, using MCGAM-enhanced P3 and standard P4/P5.
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat standard backbone P4
  - [-1, 3, C2f, [512]] # 13-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat MCGAM backbone P3
  - [-1, 3, C2f, [256]] # 16-P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 19-P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat backbone P5
  - [-1, 3, C2f, [1024]] # 22-P5/32-large

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
