# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8s with Multiscale Gaussian Attention Mechanism (MGAM).
#
# This direct s-scale config is convenient for small-object experiments such as
# VEDAI vehicle detection.

nc: 80 # number of classes
depth_multiple: 0.33
width_multiple: 0.50

# YOLOv8s backbone with MGAM after P3/P4 C2f blocks.
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, MGAM, [256]] # 5-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 6, C2f, [512, True]] # 7
  - [-1, 1, MGAM, [512]] # 8-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 3, C2f, [1024, True]] # 10
  - [-1, 1, SPPF, [1024, 5]] # 11

# YOLOv8s PAN-FPN head.
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat MGAM-enhanced backbone P4
  - [-1, 3, C2f, [512]] # 14-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat MGAM-enhanced backbone P3
  - [-1, 3, C2f, [256]] # 17-P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 20-P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat backbone P5
  - [-1, 3, C2f, [1024]] # 23-P5/32-large

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)
