# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 object detection model with FAFM-Lite neck and a training-only
# GDA-style geometric distance-aware loss reweighting strategy.
# The network structure is unchanged from FAFM-Lite; DetectGDA only carries
# loss metadata, so inference params and FLOPs stay the same.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8s-FAFM-Lite-GDA.yaml' will call this file with scale 's'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9-P5/32

# YOLOv8.0-FAFM-Lite-GDA head
head:
  # P5 -> P4 keeps standard lightweight top-down fusion.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12-P4/16

  # Keep FAFM only on the small-object-relevant P4->P3 and P3->P2 fusions.
  - [[4, 12], 1, FAFM, [256]] # 13 fuse P4 -> P3
  - [-1, 3, C2f, [256]] # 14-P3/8

  - [[2, 14], 1, FAFM, [128]] # 15 fuse P3 -> P2
  - [-1, 3, C2f, [128]] # 16-P2/4

  # Bottom-up PAN path to refine P3 and P4 only. No P5 detection head.
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat top-down P3
  - [-1, 3, C2f, [256]] # 19-P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat top-down P4
  - [-1, 3, C2f, [512]] # 22-P4/16

  # DetectGDA args: [nc, max_gain, decay_epochs, cls_gain, power, min_weight, max_weight].
  - [[16, 19, 22], 1, DetectGDA, [nc, 0.75, 50, 0.0, 1.0, 0.75, 1.25]] # Detect(P2, P3, P4)
