# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 object detection model combining FEM lateral enhancement with
# single-pass progressive PRN-Lite. FEM enhances the P2/P3/P4 lateral features
# consumed by the progressive neck, while the backbone downsampling path keeps
# using raw C2f features to preserve YOLOv8's semantic progression.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8s-FEM-PRN-Lite-Progressive.yaml' will call this file with scale 's'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone with FEM-enhanced lateral outputs
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4 raw
  - [-1, 1, FEM, [128, 8, 0.1]] # 3-P2/4 enhanced lateral
  - [-2, 1, Conv, [256, 3, 2]] # 4-P3/8 from raw P2
  - [-1, 6, C2f, [256, True]] # 5-P3/8 raw
  - [-1, 1, FEM, [256, 8, 0.1]] # 6-P3/8 enhanced lateral
  - [-2, 1, Conv, [512, 3, 2]] # 7-P4/16 from raw P3
  - [-1, 6, C2f, [512, True]] # 8-P4/16 raw
  - [-1, 1, FEM, [512, 8, 0.1]] # 9-P4/16 enhanced lateral
  - [-2, 1, Conv, [1024, 3, 2]] # 10-P5/32 from raw P4
  - [-1, 3, C2f, [1024, True]] # 11
  - [-1, 1, SPPF, [1024, 5]] # 12-P5/32

# YOLOv8.0 head with FEM-enhanced single-pass progressive PRN-Lite
head:
  # Round 1: top-down fusion to produce refined neck P4, P3, and P2.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat FEM-enhanced P4
  - [-1, 3, C2f, [512]] # 15-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat FEM-enhanced P3
  - [-1, 3, C2f, [256]] # 18-P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat FEM-enhanced P2
  - [-1, 3, C2f, [128]] # 21-P2/4

  # One progressive pass: refined P2 -> P4, then P4 -> refined P3 -> refined P2.
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 3, C2f, [512]] # 24-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 18], 1, Concat, [1]] # add round-1 refined P3
  - [-1, 3, C2f, [256]] # 27-P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 21], 1, Concat, [1]] # add round-1 refined P2
  - [-1, 3, C2f, [128]] # 30-P2/4

  - [[30, 27, 24], 1, Detect, [nc]] # Detect(P2, P3, P4)
