# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 object detection model with DSEB-enhanced P2/P3 neck features.
# The P5 detection branch is replaced by a P2 branch, while standard upsampling
# and concatenation are retained so the model contains DSEB but not FAFM.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. yolov8s-DSEB.yaml selects scale s
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9-P5/32

# YOLOv8 P2-P4 DSEB-only head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15-P3/8 top-down

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 3, C2f, [128]] # 18-P2/4
  - [-1, 1, DSEB, [128, 0.10]] # 19 enhanced P2/4

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat top-down P3
  - [-1, 3, C2f, [256]] # 22-P3/8
  - [-1, 1, DSEB, [256, 0.08]] # 23 enhanced P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat top-down P4
  - [-1, 3, C2f, [512]] # 26-P4/16

  - [[19, 23, 26], 1, Detect, [nc]] # Detect(P2, P3, P4)
