# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 object detection model with a PRN (Progressive Refinement Neck).
# The backbone remains YOLOv8; the neck follows the PRNet paper's progressive
# P2/P3/P4 refinement pattern and detects on P2/4, P3/8, and P4/16.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-PRN.yaml' will call yolov8-PRN.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9-P5/32

# YOLOv8.0 head with PRN
head:
  # Round 1: top-down fusion to produce P4, P3, and P2.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15-P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 3, C2f, [128]] # 18-P2/4

  # Round 2: refine P3, then return to P2 while reusing backbone P2 and round-1 P2.
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 3, C2f, [512]] # 20-P3/8
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 22-P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[2, 18], 1, Concat, [1]] # cat backbone P2 and round-1 P2
  - [[-1, 23], 1, Concat, [1]] # add refined P3 upsample
  - [-1, 3, C2f, [256]] # 26-P2/4

  # Round 3: refine P4 and P3, then produce the final P2.
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 3, C2f, [512]] # 29-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 32-P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[2, 26], 1, Concat, [1]] # cat backbone P2 and round-2 P2
  - [[-1, 33], 1, Concat, [1]] # add refined P3 upsample
  - [-1, 3, C2f, [128]] # 36-P2/4

  - [[36, 32, 29], 1, Detect, [nc]] # Detect(P2, P3, P4)
