# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 object detection model combining a deep YOLO-friendly SHDCBlock with
# the existing BaAFN-style FAFM neck. SHDCBlock is kept at P5/32 as an in-scale
# global-local enhancer, while FAFM remains responsible for cross-scale feature
# alignment and fusion for VisDrone small-object detection.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8s-FAFM-SHDC.yaml' will call yolov8-FAFM-SHDC.yaml with scale 's'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone with one deep SHDCBlock after SPPF
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9-P5/32
  - [-1, 1, SHDCBlock, [1024, 0.25, 0.25, [1, 2, 3], True, 1024, True]] # 10-P5/32

# YOLOv8.0-FAFM head
head:
  # Top-down FAFM fusion. Each FAFM consumes [low-level, high-level].
  - [[6, 10], 1, FAFM, [512]] # 11 fuse enhanced P5 -> P4
  - [-1, 3, C2f, [512]] # 12-P4/16

  - [[4, 12], 1, FAFM, [256]] # 13 fuse P4 -> P3
  - [-1, 3, C2f, [256]] # 14-P3/8

  - [[2, 14], 1, FAFM, [128]] # 15 fuse P3 -> P2
  - [-1, 3, C2f, [128]] # 16-P2/4-xsmall

  # Bottom-up PAN path.
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat top-down P3
  - [-1, 3, C2f, [256]] # 19-P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat top-down P4
  - [-1, 3, C2f, [512]] # 22-P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat enhanced backbone P5
  - [-1, 3, C2f, [1024]] # 25-P5/32-large

  - [[16, 19, 22, 25], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
