# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 object detection model with a single-pass progressive PRN-Lite.
# This variant keeps the YOLOv8 backbone, first builds refined neck P4/P3/P2
# features, then performs one PRN-style progressive pass using those refined
# neck features instead of reusing raw backbone features.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-PRN-Lite-Progressive.yaml' will call yolov8-PRN-Lite-Progressive.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9-P5/32

# YOLOv8.0 head with single-pass progressive PRN-Lite
head:
  # Round 1: top-down fusion to produce refined neck P4, P3, and P2.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15-P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 3, C2f, [128]] # 18-P2/4

  # One progressive pass: refined P2 -> P4, then P4 -> refined P3 -> refined P2.
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 3, C2f, [512]] # 21-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 15], 1, Concat, [1]] # add round-1 refined P3
  - [-1, 3, C2f, [256]] # 24-P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 18], 1, Concat, [1]] # add round-1 refined P2
  - [-1, 3, C2f, [128]] # 27-P2/4

  - [[27, 24, 21], 1, Detect, [nc]] # Detect(P2, P3, P4)
