# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 object detection model with lightweight BaAFN-style FAFM neck fusion.
# FAFM replaces the top-down Upsample+Concat fusion steps and adds a P2/4
# detection head for small objects such as VisDrone vehicles and pedestrians.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8s-FAFM.yaml' will call yolov8-FAFM.yaml with scale 's'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9-P5/32

# YOLOv8.0-FAFM head
head:
  # Top-down FAFM fusion. Each FAFM consumes [low-level, high-level].
  - [[6, 9], 1, FAFM, [512]] # 10 fuse P5 -> P4
  - [-1, 3, C2f, [512]] # 11-P4/16

  - [[4, 11], 1, FAFM, [256]] # 12 fuse P4 -> P3
  - [-1, 3, C2f, [256]] # 13-P3/8

  - [[2, 13], 1, FAFM, [128]] # 14 fuse P3 -> P2
  - [-1, 3, C2f, [128]] # 15-P2/4-xsmall

  # Bottom-up PAN path.
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat top-down P3
  - [-1, 3, C2f, [256]] # 18-P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat top-down P4
  - [-1, 3, C2f, [512]] # 21-P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P5
  - [-1, 3, C2f, [1024]] # 24-P5/32-large

  - [[15, 18, 21, 24], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
