# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 + PGHeadEnhance V2 for small-object detection.
# This version applies PGM at P3 and P4, while the bottom-up path keeps clean
# skips from raw C2f features.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-PGMv2.yaml' will call yolov8-PGMv2.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone - standard YOLOv8
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

# Head - PAN-FPN with PGHeadEnhance at P3 and P4
head:
  # Top-down: P5 -> P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15-P3/8 small-object layer

  # PGM at P3.
  - [-1, 1, PGHeadEnhance, []] # 16-Detect(P3)

  # Bottom-up: P3 -> P4, from raw C2f layer 15.
  - [15, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 19-P4/16 refined

  # PGM at P4.
  - [-1, 1, PGHeadEnhance, []] # 20-Detect(P4)

  # Bottom-up: P4 -> P5, from raw C2f layer 19.
  - [19, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 23-P5/32

  # Detect on PGM-enhanced P3, PGM-enhanced P4, and raw P5.
  - [[16, 20, 23], 1, Detect, [nc]] # 24
