# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 object detection model with FAFM-Lite neck and a training-only
# DiscrimLoss-style positive-sample reweighting criterion. The architecture
# matches FAFM-Lite; only the Detect metadata enables the loss adaptation.

# Parameters
nc: 80 # number of classes
discrim_ema_momentum: 0.9 # EMA for the dynamic loss threshold k
discrim_warmup_epochs: 3 # early suppression window for high-loss positives
discrim_gamma_max: 1.7 # upper hard/incorrect boundary multiplier
discrim_gamma_p: 0.08 # tanh transition sharpness
discrim_gamma_q: 60.0 # epoch where hard/incorrect separation becomes prominent
discrim_min_weight: 0.35 # lower bound for positive-sample weights
discrim_hard_weight: 1.35 # late-stage weight for hard positives
discrim_incorrect_weight: 0.35 # weight for likely incorrect/noisy positives
discrim_cls_signal_gain: 0.25 # classification contribution to the discrimination signal
discrim_es_type: linear # early suppression schedule: linear, sin, exp, piecewise
discrim_apply_box: True
discrim_apply_cls: True
discrim_apply_dfl: True
scales: # model compound scaling constants, i.e. 'model=yolov8s-FAFM-Lite-DiscrimLoss.yaml' will call yolov8-FAFM-Lite-DiscrimLoss.yaml with scale 's'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9-P5/32

# YOLOv8.0-FAFM-Lite head
head:
  # P5 -> P4 keeps standard lightweight top-down fusion.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12-P4/16

  # Keep FAFM only on the small-object-relevant P4->P3 and P3->P2 fusions.
  - [[4, 12], 1, FAFM, [256]] # 13 fuse P4 -> P3
  - [-1, 3, C2f, [256]] # 14-P3/8

  - [[2, 14], 1, FAFM, [128]] # 15 fuse P3 -> P2
  - [-1, 3, C2f, [128]] # 16-P2/4

  # Bottom-up PAN path to refine P3 and P4 only. No P5 detection head.
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat top-down P3
  - [-1, 3, C2f, [256]] # 19-P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat top-down P4
  - [-1, 3, C2f, [512]] # 22-P4/16

  - [[16, 19, 22], 1, DetectDiscrimLoss, [nc]] # Detect(P2, P3, P4)
